test/resources/mcbs/mcbs-real-invoice.xml

<?xml version="1.0" encoding="UTF-8"?>
<DOCUMENT>
<TYPE>RG</TYPE>
<ID>150580_2672556_0</ID>
<HEADER>
<BILLING_SYSTEM>MCBS unknown</BILLING_SYSTEM>
<SOURCE_SYSTEM>LIFE</SOURCE_SYSTEM>
<MANDANT>MC</MANDANT>
<LAYOUT>
<PDC>201229c</PDC>
<INI>210504</INI>
</LAYOUT>
<EXT_VERSION>-</EXT_VERSION>
<XML_VERSION>R2021.1</XML_VERSION>
<INVOICE_DATE>09.02.2026</INVOICE_DATE>
<INV_DETAILS>
<INV_DETAIL>
<CONTEXT>PRECTR</CONTEXT>
<ID>RGTX</ID>
<VALUE>domainumstellung-freenet-20260120</VALUE>
</INV_DETAIL>
</INV_DETAILS>
<BRAND>
<CODE_SHORTCUT>MCM</CODE_SHORTCUT>
<CODE_DESC>freenet</CODE_DESC>
<SHORTCUT>MOBILCOM_DEBITEL</SHORTCUT>
<DESC>freenet</DESC>
<GROUP_SHORTCUT>MC</GROUP_SHORTCUT>
<GROUP_DESC>Mobilcom</GROUP_DESC>
</BRAND>
<CLIENTBANK_ACNT>DE08214400450844443200</CLIENTBANK_ACNT>
<CLIENTBANK_CODE>COBADEFFXXX</CLIENTBANK_CODE>
<DELIVERY_MODE>
<SUPPLY>
<TYPE>PORTAL</TYPE>
</SUPPLY>
</DELIVERY_MODE>
<REUNITE>
<ID>2120710</ID>
<SORT>150580_2672556_0</SORT>
</REUNITE>
<CURRENT_DATE>09.02.2026</CURRENT_DATE>
<CURRENT_TIME>09:39:23</CURRENT_TIME>
<BILLRUN_ID>150580</BILLRUN_ID>
<BILLRUN_DATE>09.02.2026</BILLRUN_DATE>
<INVOICE_TYPE>ORIGINAL</INVOICE_TYPE>
<INVOICE_DEF>2672556</INVOICE_DEF>
<INVOICE_NO>M26008957394</INVOICE_NO>
<INV_CURRENCY>EUR</INV_CURRENCY>
<EURO_INVOICE>TRUE</EURO_INVOICE>
<END_BY_CUSTOMER>TRUE</END_BY_CUSTOMER>
<SHOW_COSTCENTRE>FALSE</SHOW_COSTCENTRE>
<REPRINT>FALSE</REPRINT>
</HEADER>
<RECIPIENT>
<PERSON_NO>2120710</PERSON_NO>
<BILL_PERSON_NO>1112053692</BILL_PERSON_NO>
<OPENING>Hallo Max Mustermann</OPENING>
<ADDRESS>
<SHORT_OPENING>Herr</SHORT_OPENING>
<FIRSTNAME>Max</FIRSTNAME>
<NAME>Mustermann</NAME>
<STREET>Musterstraße 123</STREET>
<POSTCODE>12345</POSTCODE>
<CITY>Berlin</CITY>
</ADDRESS>
<COM_INFOS>
<COM_INFO>
<TYPE>EML</TYPE>
<ENTRY>max.mustermann@example.com</ENTRY>
<CONTEXT>EMAIL_NOTIFY</CONTEXT>
</COM_INFO>
<COM_INFO>
<TYPE>TEL</TYPE>
<ENTRY>030-123456</ENTRY>
<CONTEXT>PRIVATE</CONTEXT>
</COM_INFO>
</COM_INFOS>
<GENDER>MALE</GENDER>
<BIRTHDAY>15.03.1970</BIRTHDAY>
<AGE_ON_BILLDATE>55</AGE_ON_BILLDATE>
</RECIPIENT>
<CUSTOMER>
<TYPE_SHORTCUT>PP</TYPE_SHORTCUT>
<TYPE_ATTRIBUTES>P___</TYPE_ATTRIBUTES>
<MRKTG_PERMITS>
<MRKTG_PERMIT>
<INITIATOR>CUSTOMER</INITIATOR>
<CLASSIFICATION>NONVOICE</CLASSIFICATION>
</MRKTG_PERMIT>
<MRKTG_PERMIT>
<INITIATOR>DEALER</INITIATOR>
<CLASSIFICATION>KEW</CLASSIFICATION>
</MRKTG_PERMIT>
<MRKTG_PERMIT>
<INITIATOR>SERVICE_PROVIDER</INITIATOR>
<CLASSIFICATION>KEW</CLASSIFICATION>
</MRKTG_PERMIT>
</MRKTG_PERMITS>
<MAIN_NETWORK>VF</MAIN_NETWORK>
<RECIPIENT_DIFF>FALSE</RECIPIENT_DIFF>
</CUSTOMER>
<INVOICE_DATA>
<PAYMENT_MODE>
<PAYMENT_TYPE>SEPADEBIT</PAYMENT_TYPE>
<ACCOUNT_OWNER>
<CUSTOMER_DIFF>FALSE</CUSTOMER_DIFF>
</ACCOUNT_OWNER>
<SEPA_MANDATE>MC-2120710-000000001</SEPA_MANDATE>
<BANK_ACCOUNT>DE00000000000000000000</BANK_ACCOUNT>
<BANK_CODE>SOLADES1ULM</BANK_CODE>
<PAYMENT_TERM>1</PAYMENT_TERM>
<DUE_DATE>16.02.2026</DUE_DATE>
</PAYMENT_MODE>
<FRAMES>
<NUMBERS>1</NUMBERS>
<UNITS>1</UNITS>
<AMOUNTS>
<NUMBERS>5</NUMBERS>
<AMOUNT>
<TYPE>INSEP_GROSS</TYPE>
<VALUE>0,9900</VALUE>
</AMOUNT>
<AMOUNT>
<TYPE>SUBTOTAL</TYPE>
<VALUE>28,98</VALUE>
</AMOUNT>
<AMOUNT>
<TYPE>TOTAL</TYPE>
<VALUE>29,97</VALUE>
</AMOUNT>
<AMOUNT>
<TYPE>TOTAL_NET</TYPE>
<VALUE>24,3529</VALUE>
</AMOUNT>
<AMOUNT>
<TYPE>TOTAL_VAT</TYPE>
<VALUE>4,63</VALUE>
</AMOUNT>
</AMOUNTS>
<DIFF_VATS>
<NUMBERS>1</NUMBERS>
<DIFF_VAT>
<VAT_RATE>19</VAT_RATE>
<VAT>4,63</VAT>
<NET>24,3529</NET>
</DIFF_VAT>
</DIFF_VATS>
<FRAME>
<ID>TELCO</ID>
<TITLE>Mobilfunk-Vertragsabrechnungen</TITLE>
<SHOW_TITLE>TRUE</SHOW_TITLE>
<SHOW_SEQUENCES>FALSE</SHOW_SEQUENCES>
<NUMBERS>1</NUMBERS>
<AREA>
<ID>STANDARD</ID>
<NUMBERS>1</NUMBERS>
<UNIT>
<SEQUENCE_NO>1</SEQUENCE_NO>
<CONTRACT_DATA>
<TYPE>TELCO</TYPE>
<CONTRACT_NO>2760184</CONTRACT_NO>
<CLASSIFICATION>6</CLASSIFICATION>
<TARIFF_SHORTCUT>D2MM-GRL5GB22SO</TARIFF_SHORTCUT>
<TARIFF>green LTE 5 GB</TARIFF>
<NETWORK>VF</NETWORK>
<TECHNOLOGY>2G</TECHNOLOGY>
<SUBSEGMENT>CR</SUBSEGMENT>
<CUSTOMER_NO>2120710</CUSTOMER_NO>
<TCS_TITLE>Teilnehmer:</TCS_TITLE>
<TCS_VALUE>Max Mustermann</TCS_VALUE>
<CONNECTS>
<CONNECT>
<TYPE>MAIN</TYPE>
<TITLE>Mobilfunk-Rufnummer</TITLE>
<CONNECT_NO>01791234567</CONNECT_NO>
<CONNECT_NO_F>0179 / 1234567</CONNECT_NO_F>
<SIM_NO>89330123456789012345</SIM_NO>
</CONNECT>
</CONNECTS>
<EVN_SERVICE>
<MODEL>STANDARD</MODEL>
<SHOW_EVN>TRUE</SHOW_EVN>
</EVN_SERVICE>
<CALL_STORAGE>
<STORE_DAYS>90</STORE_DAYS>
<STORE_FORMAT>SK</STORE_FORMAT>
<PRINT_FORMAT>EK</PRINT_FORMAT>
</CALL_STORAGE>
<DETAILS>
<DETAIL>
<CONTEXT>BILLOUTPUT</CONTEXT>
<ID>ITEMIZED_PRODUCT</ID>
<VALUE>32130</VALUE>
</DETAIL>
<DETAIL>
<CONTEXT>NETWORK</CONTEXT>
<ID>VF</ID>
<VALUE>2000-12-27</VALUE>
</DETAIL>
<DETAIL>
<CONTEXT>BILLOUTPUT</CONTEXT>
<ID>CALL_STORE</ID>
<VALUE>90SKEK</VALUE>
</DETAIL>
<DETAIL>
<CONTEXT>NETWORK</CONTEXT>
<ID>VF</ID>
<VALUE>2013-07-20</VALUE>
</DETAIL>
<DETAIL>
<CONTEXT>NETWORK</CONTEXT>
<ID>VF</ID>
<VALUE>2016-03-08</VALUE>
</DETAIL>
<DETAIL>
<CONTEXT>BILLOUTPUT</CONTEXT>
<ID>PHONE_NUMEBR</ID>
<VALUE>0491791234567</VALUE>
</DETAIL>
<DETAIL>
<CONTEXT>BILLOUTPUT</CONTEXT>
<ID>SIM_NUMEBR</ID>
<VALUE>89330123456789012345</VALUE>
</DETAIL>
<DETAIL>
<CONTEXT>LAYOUT</CONTEXT>
<ID>NONE</ID>
<VALUE>TRUE</VALUE>
</DETAIL>
</DETAILS>
</CONTRACT_DATA>
<SECTIONS>
<NUMBERS>2</NUMBERS>
<SECTION>
<TITLE>Zwischensumme netto</TITLE>
<SHOW_SUBTOTAL>TRUE</SHOW_SUBTOTAL>
<SUBTOTAL>24,3529</SUBTOTAL>
<BILLITEM_GRPS>
<NUMBERS>2</NUMBERS>
<BILLITEM_GRP>
<TITLE>Basisleistungen</TITLE>
<PERIOD>01.02.2026 - 28.02.2026</PERIOD>
<PERIOD_F></PERIOD_F>
<CHARGE>24,3529</CHARGE>
<SHOW_COUNT>TRUE</SHOW_COUNT>
<BILLITEMS>
<NUMBERS>2</NUMBERS>
<BILLITEM>
<SEQUENCE_NO>1</SEQUENCE_NO>
<COUNTER>1</COUNTER>
<TYPE>GG</TYPE>
<PRODUCT_TYPE>SERVICE</PRODUCT_TYPE>
<PRODUCT_NAME>Grundgebühr</PRODUCT_NAME>
<PRODUCT_CODE>10001</PRODUCT_CODE>
<PERIOD>01.02.2026 - 28.02.2026</PERIOD>
<CHARGE>18,4790</CHARGE>
<VAT_RATE>19</VAT_RATE>
<BILLING_REF>6</BILLING_REF>
<SUBTOTALS>
<CHARGE_SUBTOTAL>18,4790</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>18,4790</UNIT_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
<BILLITEM>
<SEQUENCE_NO>2</SEQUENCE_NO>
<COUNTER>1</COUNTER>
<TYPE>SAVETV1M1MTBBK</TYPE>
<PRODUCT_TYPE>SERVICE</PRODUCT_TYPE>
<PRODUCT_NAME>Save.TV 1 Monat (DLS1M1TB1G0699)</PRODUCT_NAME>
<PRODUCT_CODE>12130</PRODUCT_CODE>
<ADVERTISING>Ihr Online-Videorecorder für Ihr Smartphone</ADVERTISING>
<PERIOD>01.02.2026 - 28.02.2026</PERIOD>
<CHARGE>5,8739</CHARGE>
<VAT_RATE>19</VAT_RATE>
<BILLING_REF>33</BILLING_REF>
<SUBTOTALS>
<CHARGE_SUBTOTAL>24,3529</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>24,3529</UNIT_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
</BILLITEMS>
</BILLITEM_GRP>
<BILLITEM_GRP>
<TITLE>Verbindungen</TITLE>
<PERIOD>08.01.2026 - 08.02.2026</PERIOD>
<PERIOD_F></PERIOD_F>
<CHARGE>0,0000</CHARGE>
<SHOW_COUNT>TRUE</SHOW_COUNT>
<BILLITEMS>
<NUMBERS>5</NUMBERS>
<BILLITEM>
<SEQUENCE_NO>3</SEQUENCE_NO>
<CONNECT_CAT>VOICE</CONNECT_CAT>
<COUNTER>21</COUNTER>
<TYPE>FN</TYPE>
<PRODUCT_TYPE>CALL</PRODUCT_TYPE>
<PRODUCT_NAME>Verbindungen ins dt. Festnetz (FN)</PRODUCT_NAME>
<PRODUCT_CODE>100</PRODUCT_CODE>
<PERIOD>09.01.2026 - 07.02.2026</PERIOD>
<CHARGE>0,0000</CHARGE>
<VAT_RATE>19</VAT_RATE>
<BILLING_REF>7</BILLING_REF>
<CLAIM_PRODUCT>24103</CLAIM_PRODUCT>
<SUBTOTALS>
<CHARGE_SUBTOTAL>24,3529</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>24,3529</UNIT_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
<BILLITEM>
<SEQUENCE_NO>4</SEQUENCE_NO>
<CONNECT_CAT>VOICE</CONNECT_CAT>
<COUNTER>108</COUNTER>
<TYPE>NI</TYPE>
<PRODUCT_TYPE>CALL</PRODUCT_TYPE>
<PRODUCT_NAME>Netzinterne Verbindungen (NI)</PRODUCT_NAME>
<PRODUCT_CODE>105</PRODUCT_CODE>
<PERIOD>09.01.2026 - 08.02.2026</PERIOD>
<CHARGE>0,0000</CHARGE>
<VAT_RATE>19</VAT_RATE>
<BILLING_REF>11</BILLING_REF>
<CLAIM_PRODUCT>24104</CLAIM_PRODUCT>
<SUBTOTALS>
<CHARGE_SUBTOTAL>24,3529</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>24,3529</UNIT_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
<BILLITEM>
<SEQUENCE_NO>5</SEQUENCE_NO>
<CONNECT_CAT>VOICE</CONNECT_CAT>
<COUNTER>4</COUNTER>
<TYPE>NX</TYPE>
<PRODUCT_TYPE>CALL</PRODUCT_TYPE>
<PRODUCT_NAME>Netzexterne Verbindungen (NX)</PRODUCT_NAME>
<PRODUCT_CODE>107</PRODUCT_CODE>
<PERIOD>20.01.2026 - 05.02.2026</PERIOD>
<CHARGE>0,0000</CHARGE>
<VAT_RATE>19</VAT_RATE>
<BILLING_REF>16</BILLING_REF>
<CLAIM_PRODUCT>24106</CLAIM_PRODUCT>
<SUBTOTALS>
<CHARGE_SUBTOTAL>24,3529</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>24,3529</UNIT_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
<BILLITEM>
<SEQUENCE_NO>6</SEQUENCE_NO>
<CONNECT_CAT>VOICE</CONNECT_CAT>
<COUNTER>1</COUNTER>
<TYPE>RU</TYPE>
<PRODUCT_TYPE>CALL</PRODUCT_TYPE>
<PRODUCT_NAME>Rufumleitungen (RU)</PRODUCT_NAME>
<PRODUCT_CODE>276</PRODUCT_CODE>
<PERIOD>12.01.2026 - 12.01.2026</PERIOD>
<CHARGE>0,0000</CHARGE>
<VAT_RATE>19</VAT_RATE>
<BILLING_REF>19</BILLING_REF>
<CLAIM_PRODUCT>21829</CLAIM_PRODUCT>
<SUBTOTALS>
<CHARGE_SUBTOTAL>24,3529</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>24,3529</UNIT_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
<BILLITEM>
<SEQUENCE_NO>7</SEQUENCE_NO>
<CONNECT_CAT>DATA</CONNECT_CAT>
<COUNTER>153</COUNTER>
<TYPE>DATA</TYPE>
<PRODUCT_TYPE>CALL</PRODUCT_TYPE>
<PRODUCT_NAME>Datenverbindungen (DATA)</PRODUCT_NAME>
<PRODUCT_CODE>123</PRODUCT_CODE>
<PERIOD>08.01.2026 - 08.02.2026</PERIOD>
<CHARGE>0,0000</CHARGE>
<VAT_RATE>19</VAT_RATE>
<BILLING_REF>20</BILLING_REF>
<CLAIM_PRODUCT>24111</CLAIM_PRODUCT>
<SUBTOTALS>
<CHARGE_SUBTOTAL>24,3529</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>24,3529</UNIT_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
</BILLITEMS>
</BILLITEM_GRP>
</BILLITEM_GRPS>
</SECTION>
<SECTION>
<TITLE>Sonderdienste Drittanbieter (brutto)</TITLE>
<SHOW_SUBTOTAL>TRUE</SHOW_SUBTOTAL>
<SUBTOTAL>0,9900</SUBTOTAL>
<BILLITEM_GRPS>
<NUMBERS>1</NUMBERS>
<BILLITEM_GRP>
<TITLE>Nutzung Sonderdienste Drittanbieter (brutto)</TITLE>
<PERIOD>29.01.2026 - 29.01.2026</PERIOD>
<PERIOD_F></PERIOD_F>
<CHARGE>0,9900</CHARGE>
<SHOW_COUNT>TRUE</SHOW_COUNT>
<BILLITEMS>
<NUMBERS>1</NUMBERS>
<BILLITEM>
<SEQUENCE_NO>8</SEQUENCE_NO>
<CONNECT_CAT>NONE</CONNECT_CAT>
<COUNTER>1</COUNTER>
<TYPE>SFT</TYPE>
<PRODUCT_TYPE>CALL</PRODUCT_TYPE>
<PRODUCT_NAME>Sonderdienste Drittanbieter (SFT)</PRODUCT_NAME>
<PRODUCT_CODE>30274</PRODUCT_CODE>
<PERIOD>29.01.2026 - 29.01.2026</PERIOD>
<CHARGE>0,9900</CHARGE>
<VAT_RATE>INCLUDED</VAT_RATE>
<BILLING_REF>23</BILLING_REF>
<OPT_PARAMS>
<CONT_PROVIDER>
<ID>1650004616</ID>
<CONTACT>Apple Distribution International, Hollyhill Industrial Estate, IRL-T23YK84 Cork, Irland, Tel.: 0800 6645451, Internet: https://support.apple.com</CONTACT>
<SERVICES>1x Apple iTunes / App Store Kauf 0,9900 EUR</SERVICES>
</CONT_PROVIDER>
</OPT_PARAMS>
<SUBTOTALS>
<CHARGE_SUBTOTAL>25,3429</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>25,3429</UNIT_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
</BILLITEMS>
</BILLITEM_GRP>
</BILLITEM_GRPS>
</SECTION>
</SECTIONS>
</UNIT>
</AREA>
</FRAME>
</FRAMES>
</INVOICE_DATA>
</DOCUMENT>